app/views/lists/_form.html.erb

  <%= fields_for :list do |x| %>
    <%= x.collection_check_boxes(:course_id, Course.all, :id, :name) %><br>
---
SELECT "courses".* FROM "courses"