app/helpers/student_helper.rb

  def student_courses(student)
    courses = []
    student.list.course_id.split(/\W/).each do |id|
      if id != ""
        course = Course.find_by(id: id)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]