app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.search(params[:search])

INSERT INTO "courses" ("name", "description") VALUES (?, ?)  [["name", "Intro to Pizza 101"], ["description", "how to make a pizza for noobs"]]
---
  def create
    @course = Course.new(course_params)

    if @course.valid?
      @course.save