app/controllers/lists_controller.rb

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
  def destroy
    @list.delete

SELECT "lists".* FROM "lists" WHERE "lists"."student_id" = ? LIMIT ?  [["student_id", 4], ["LIMIT", 1]]
---
  def set_list
    @list = List.find_by(student_id: session[:user_id])