app/controllers/lists_controller.rb

    def destroy
      @list = List.find(params[:id])
      @list.delete
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 4]]