app/controllers/lists_controller.rb

  def create
    if list_params
      list_params[:course_id].each do |course_id|
        if course_id != ""
          List.find_or_create_by(student_id: current_user, course_id: course_id)
---
INSERT INTO "lists" ("student_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["course_id", 1], ["created_at", "2020-11-03 03:42:15.646190"], ["updated_at", "2020-11-03 03:42:15.646190"]]
SELECT "lists".* FROM "lists" WHERE "lists"."student_id" = ? AND "lists"."course_id" = ? LIMIT ?  [["student_id", 2], ["course_id", 1], ["LIMIT", 1]]

  def edit
    @lists = List.where(student_id: current_user)
---
SELECT "lists".* FROM "lists" WHERE "lists"."student_id" = ? LIMIT ?  [["student_id", 4], ["LIMIT", 1]]

  def update
    if list_params
      list_params[:course_id].each do |course_id|
        if course_id != ""
          List.update(student_id: current_user, course_id: course_id)
---
UPDATE "lists" SET "course_id" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["course_id", 3], ["updated_at", "2020-11-03 03:37:33.923555"], ["id", 3]]