app/controllers/sessions_controller.rb

  def create
    @student = Student.find_by(school_email: params[:school_email])
---
SELECT "students".* FROM "students" WHERE "students"."school_email" = ? LIMIT ?  [["school_email", "justinzweifel@university.com"], ["LIMIT", 1]]