app/controllers/sessions_controller.rb

  def create

    @student = Student.find_or_create_by(email: auth['info']['email']

    return head(:forbidden) unless @student && @student.authenticate(params[:password])
    session[:user_id] = @student.id
    redirect_to student_path(@student)
  end

  private

  def auth
    request.env['omniauth.auth']
  end

end
---
SELECT "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "justin@college.edu"], ["LIMIT", 1]]