app/controllers/students_controller.rb

INSERT INTO "students" ("name", "school_email", "password_digest", "major", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
     @student = Student.create(student_params)