app/models/course.rb

SELECT "courses".* FROM "courses" WHERE "courses"."name" = ? LIMIT ?  [["name", "Computer Science 145"], ["LIMIT", 1]]
---
  def self.search(search)
    if search
      course = Course.find_by(name: search)